Repository: omegat-fi/B333-MateCat
Catalog: MateCat PROJEKTI/tm/unapproved.tmx
Source language: en
Languages: fi

source: o do {1>without any private TM<1}.
fi: o käännä {1>ilman yksityistä käännösmuistia<1}

source: In this way, you will receive suggestions and store your translation in a {2>public TM exclusively for MateCat users<2}{3>.<3}
fi: Tällä tavoin pystyt saamaan käännösehdotuksia ja tallentamaan käännöksesi {2>julkiseen käännösmuistiin, joka on tarkoitettu vain MateCatin käyttäjille<2}{3>.<3}

source: If you choose to receive suggestions from both the MT and the TM, you can receive from 10 to 20% more matches for all your translations.
fi: Jos päätät ottaa vastaan käännösehdotuksia konekäännöksistä ja käännösmuistista, voit saada 10-20 % enemmän osumia kaikille käännöksillesi.

source: This can increase your productivity and enable you to work more quickly.
fi: Tämä voi parantaa tehokkuuttasi ja mahdollistaa nopeamman työnopeuden.

source: {1>Translating<1}: the {2>Translation Editor<2}{3> window shows the translation interface.<3}
fi: {1>Kääntäminen<1}: {2>Käännöseditori<2}{3>-ikkuna näyttää käännöskäyttöliittymän.<3}

source: {3>It has 2 columns: source text in the left column and translated text in the right column.<3}
fi: {3>Siinä on kaksi saraketta: lähdeteksti vasemmassa sarakkeessa ja käännetty teksti oikeassa sarakkeessa.<3}

source: {3>When you open a segment during your translation, MateCat searches for <3}{4>matches from translation memories<4}{5>2 <5}{6>and from machine translations<6}, if
fi: {3>Kun avaat segmentin kääntämisen aikana, MateCat etsii <3}{4>osumia käännösmuisteista<4}{5><5}{6> ja konekäännöksistä<6}, jos

source: 2 {1>Both your private TM, if any, and the public shared translation memory.<1}
fi: {1>Mahdollisesta yksityisestä käännösmuistista, sekä julkisesta jaetusta käännösmuistista<1}

source: Page 9
fi: Sivu 9

source: enabled.
fi: tämä vaihtoehto on päällä.

source: During the translation, MateCat also automatically performs some {1>quality checks<1}{2> on Tag mismatches, Tag order mismatches, Whitespace mismatches and translation conflicts.<2}
fi: Käännöksen aikana MateCat myös suorittaa automaattisesti joitain {1>laatutarkastuksia <1}{2>liittyen tunniste-ristiriitoihin, tunnisteiden järjestysvirheisiin, tyhjämerkkien ristiriitoihin ja käännös ristiriitoihin.<2}

source: A {2>progress bar<2} at the bottom of the Translation Editor window shows the progress of your translation.
fi: {2>Etenemispalkki<2} käännöseditori-ikkunan alalaidassa näyttää käännöksen edistymisen.

source: The translation is finished when the progress bar is at {3>100% complete<3}, when there are no {4>To-do <4}words
fi: Käännös on valmis kun etenemispalkki on {3>100 %<3} täynnä, kun {4>Käännettäviä sanoja<4} (To-do words) ei ole enää jäljellä

source: {1}{2>left and when <2}{3>no errors are reported in the QA module<3}
fi: {1}{2>ja kun <2}{3>yhtään virheitä ei ole raportoitu laaduntarkistus-moduulissa.<3}

source: {4>When the translation is complete and all issues have been fixed, you can click on the <4}{5>Download translation <5}{6>button to download the translated file in the original format.<6}
fi: {4>Kun käännös on valmis ja kaikki sen ongelmat on korjattu, voit klikata <4}{5>“Download Translation”-<5}{6>painiketta (Lataa käännös) ladataksesi käännetyn tiedoston sen alkuperäisessä tiedostomuodossa.<6}

source: Page 10
fi: Sivu 10

source: Start working with MateCat
fi: Aloita käyttämään MateCatia

source: MateCat Home Page and Login
fi: MateCatin kotisivut ja sisäänkirjautuminen

source: There are currently two versions of the MateCat translation tool:
fi: MateCat-käännöstyökalusta on tällä hetkellä tarjolla kaksi versiota:

source: • {1>http://demo.matecat<1}{2>.com <2}{3>– Open source version to translate XLIFF files.<3}
fi: • {1>http://demo.matecat<1}{2>.com - Avoimen lähdekoodin versio XLIFF-tiedostojen kääntämiseen.<2}

source: {3>The user can also install and administer the open source version on his/her own server.<3}
fi: {3>Käyttäjä voi myös asentaa ja hallita avoimen lähdekoodin versiota omalla palvemillellaan.<3}

source: {3>For further instructions and details, refer to the <3}{4>{5>installation guide<5}{6>.<6}<4}
fi: {3>Lisää ohjeita ja lisätietoja löydät <3}{4>{5>asennusoppaasta<5}{6>.<6}<4}

source: {1>• <1}{2>http://www.matecat.com <2}– Proprietary version which includes filters for {3>56<3} {4>file formats<4}{5>.<5}
fi: {1>• <1}{2>http://www.matecat.com <2}– Patentoitu versio, joka sisältää suodattimia {3>56<3} {4>tiedostomuodolle<4}{5>.<5}

source: {6>This is the version we use as a reference for this user manual.<6}
fi: {6>Kyseistä versiota käytetään viitteenä tässä käyttöoppaassa.<6}

source: This version of MateCat is free for both personal and business translation jobs.
fi: Tämä MateCatin versio on ilmainen niin henkilökohtaisiin kuin myös yritystason käännöstöihin.

source: {1>In order to store and recover your projects in MateCat, you should <1}{2>log in <2}by clicking on the {3>login <3}button at the bottom of the MateCat home page.
fi: {1>Jotta pystyt tallentamaan ja palauttamaan projektejasi MateCatissa, sinun tulisi <1}{2>kirjautua sisään <2}painamalla MateCatin kotisivun alalaidassa olevaa {3>“Login”<3} -painiketta.

source: You will be asked to sign in using your {4>Google account<4}.
fi: Sinua pyydetään kirjautumaan sisään {4>Google-tiliäsi<4} käyttäen.

source: Creating Projects
fi: Projektien luonti

source: {1>In MateCat, translation jobs are organised into <1}{2>projects<2}.
fi: {1>MateCatissa käännöstyöt on järjestetty <1}{2>projekteihin<2}.

source: A project is made up of one or more translation {3>jobs <3}and each one is associated with a unique {4>job URL.<4}
fi: Projekti koostuu yhdestä tai useammasta {3>työstä<3} ja jokaiselle on annettu oma {4>työn URL-linkki.<4}

source: Each project can be created with one source language and {5>one or more target languages<5}.
fi: Jokaisen projektin voi luoda yhdellä lähdekielellä ja {5>yhdellä tai useammalla kohdekielellä<5}.

source: {1>To create a new project in MateCat, visit <1}{2>{u>http://www.matecat.com<u}<2}
fi: {1>Luodaksesi uuden projektin MateCatissa, mene osoitteeseen <1}{2>{u>http://www.matecat.com<u}<2}

source: Page 11
fi: Sivu 11

source: All you need to do is select the language combination and upload the file(s) to translate.
fi: Sinun tarvitsee ainoastaan valita kieliyhdistelmä ja ladata käännettävä tiedosto(t) sivustolle.

source: This is necessary to create your project.
fi: Tämä vaaditaan projektin luontia varten.

source: By clicking on {1>Options<1}{2>, you can add options or change preferential options.<2}
fi: Klikkaamalla {1>“Options”<1}{2>-painiketta (Asetukset), voit lisätä asetuksia tai vaihtaa etujärjestelyasetuksia.<2}

source: If you need to store your project and recover it later, you should firstly {1>log in<1}{2> using the <2}{3>Login <3}{4>button at the bottom of the page.<4}
fi: Jos sinun tarvitsee tallentaa projektisi tai palauttaa se myöhemmin, sinun tulisi ensin {1>kirjautua sisään<1}{2> käyttämällä {4>sivun alalaidassa olevaa <4}<2}{3>“Login”<3} -painiketta.

source: {4>This allows you to add all your projects to your Management Panel, recover all information about projects, such as the <4}{5>volume analysis<5}{6> or job URL, and check the progress of translations.<6}
fi: {4>Tämä mahdollistaa kaikkien projektiesi lisäämisen omaan Hallintapaneeliisi, kaikkien projektiesi tietojen palauttamisen, kuten <4}{5>volyymianalyysin<5}{6> tai töiden linkit, ja tarkistaa käännösten etenemistilanteen.<6}

source: {1}Note: it is not possible to work on MateCat offline.
fi: {1}Huomautus: MateCatia ei voi käyttää offline-tilassa.

source: You can only save your translation and receive suggestions from the MT(s) and TM(s) if you work online.
fi: Voit ainoastaan tallentaa käännöksesi ja saada käännösehdotuksia konekäännöksistä ja käännösmuisteista jos olet online-tilassa.

source: How To Upload File(s) for Translation
fi: Kuinka ladata tiedostoja käännettäväksi

source: Page 12
fi: Sivu 12
